/*
12345
1234
123
12
1

12345
2345
345
45
5

54321
4321
321
21
1

54321
5432
543
54
5
***** 1:0:5 => 
 **** 2:1:4 => 2
  *** 3:2:3 => 32
   ** 4:3:2 => 432
    * 5:4:1 => 5432
첫 번쨰 ;줄 바꿈, 두 번째; 별의 개수 세 번째

줄의 개수 {

    띄어쓰기 개수 {
    }
    별 개수 {
    }
}
*/

#include<stdio.h>
int main() {


    int i = 1;
    while (i <= 5) {

        int j = i;
        while (j > 1) {
            printf(" ");
            j = j - 1;
        }
        int k = 5;
        while (k >= i) {
            printf("*");
            k = k - 1;
        }


        printf("\n");
        i = i + 1;
    }
}